Revit 2026 API

# FilteredWorksetIdIterator Class

---

An iterator to a set of workset ids filtered by the settings of a FilteredWorksetCollector.

SystemObject Autodesk.Revit.DBFilteredWorksetIdIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilteredWorksetIdIterator : IEnumerator<WorksetId>
```
```vb
Public Class FilteredWorksetIdIterator
	Implements IEnumerator(Of WorksetId)
```
```cpp
public ref class FilteredWorksetIdIterator : IEnumerator<WorksetId^>
```
```fsharp
type FilteredWorksetIdIterator =
    class
        interface IEnumerator<WorksetId>
    end
```

The FilteredWorksetIdIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilteredWorksetIdIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | The current workset id found by the iterator. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next workset id passing the filter. |
|  | Reset | Resets the iterator to the beginning. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace